# SetMaterialIdForCurrentExportState Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFC..::..SetMaterialIdForCurrentExportState Method
ExporterIFC Class See Also
---
This sets the material id that is to be associated with the element in the current export state.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void SetMaterialIdForCurrentExportState(
	ElementId elementId
)
```

Visual Basic
---
```text
Public Sub SetMaterialIdForCurrentExportState ( _
	elementId As ElementId _
)
```

Visual C++
---
```text
public:
void SetMaterialIdForCurrentExportState(
	ElementId^ elementId
)
```

# ### Parameters
elementId
    Type: Autodesk.Revit.DB..::..ElementId The material id.
# Remarks
Even though there could be several materials associated with the element (set during PushExportState()), unless the element has support for IfcMaterialLayerSet, IFC output will include only this one.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace